# 10数据聚合与分组运算

In [3]:
import pandas as pd
import numpy as np

In [4]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
 'key2' : ['one', 'two', 'one', 'two', 'one'], 'data1' : np.random.randn(5), 'data2' : np.random.randn(5)})

In [5]:
df

      data1     data2 key1 key2
0  0.404707  0.091001    a  one
1 -0.871899  0.848397    a  two
2 -1.155719 -0.770773    b  one
3 -0.428884 -0.748555    b  two
4 -0.919550 -0.305541    a  one

In [6]:
grouped = df['data1'].groupby(df['key1'])

In [7]:
grouped

In [8]:
grouped.mean()

key1
a   -0.462247
b   -0.792301
Name: data1, dtype: float64

In [9]:
means = df['data1'].groupby([df['key1'],df['key2']]).mean()

In [10]:
means

key1  key2
a     one    -0.257421
      two    -0.871899
b     one    -1.155719
      two    -0.428884
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a    -0.257421 -0.871899
b    -1.155719 -0.428884

In [12]:
states = np.array(['Ohio', 'California', 'California', 'Ohio','Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])

In [13]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.871899
            2006   -1.155719
Ohio        2005   -0.012088
            2006   -0.919550
Name: data1, dtype: float64

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.462247  0.211286
b    -0.792301 -0.759664

In [15]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.257421 -0.107270
     two  -0.871899  0.848397
b    one  -1.155719 -0.770773
     two  -0.428884 -0.748555

In [16]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [19]:
for name, group in df.groupby('key1'):
    print(name)
    print('*********')
    print(group)
    print('--------')

a
*********
      data1     data2 key1 key2
0  0.404707  0.091001    a  one
1 -0.871899  0.848397    a  two
4 -0.919550 -0.305541    a  one
--------
b
*********
      data1     data2 key1 key2
2 -1.155719 -0.770773    b  one
3 -0.428884 -0.748555    b  two
--------

In [20]:
for (k1,k2),group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
      data1     data2 key1 key2
0  0.404707  0.091001    a  one
4 -0.919550 -0.305541    a  one
a two
      data1     data2 key1 key2
1 -0.871899  0.848397    a  two
b one
      data1     data2 key1 key2
2 -1.155719 -0.770773    b  one
b two
      data1     data2 key1 key2
3 -0.428884 -0.748555    b  two

In [21]:
pieces = dict(list(df.groupby('key1')))

In [22]:
pieces['b']

      data1     data2 key1 key2
2 -1.155719 -0.770773    b  one
3 -0.428884 -0.748555    b  two

In [23]:
df

      data1     data2 key1 key2
0  0.404707  0.091001    a  one
1 -0.871899  0.848397    a  two
2 -1.155719 -0.770773    b  one
3 -0.428884 -0.748555    b  two
4 -0.919550 -0.305541    a  one

In [24]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [25]:
grouped = df.groupby(df.dtypes, axis=1)

In [26]:
for dtype,group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0  0.404707  0.091001
1 -0.871899  0.848397
2 -1.155719 -0.770773
3 -0.428884 -0.748555
4 -0.919550 -0.305541
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [28]:
df.groupby(['key1','key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.107270
     two   0.848397
b    one  -0.770773
     two  -0.748555

In [33]:
df['data2'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one    -0.107270
      two     0.848397
b     one    -0.770773
      two    -0.748555
Name: data2, dtype: float64

In [34]:
people = pd.DataFrame(np.random.randn(5, 5), columns=['a', 'b', 'c', 'd', 'e'], index=['Joe', 'Steve', 'Wes', 'Jim',
'Travis'])

In [35]:
people.iloc[2:3,[1,2]]=np.nan

In [36]:
people

               a         b         c         d         e
Joe     0.033459 -0.195207  1.911560  1.189666  0.460616
Steve   0.403950 -0.718331 -0.911294 -0.270169 -0.021204
Wes     0.807174       NaN       NaN  0.071015  0.193377
Jim     0.750745  0.083138 -0.644865 -1.263093 -1.925777
Travis  0.666771  1.121080 -0.450967 -0.094667 -0.660190

In [37]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [39]:
by_column = people.groupby(mapping,axis=1)

In [40]:
by_column.sum()

            blue       red
Joe     3.101226  0.298868
Steve  -1.181463 -0.335585
Wes     0.071015  1.000551
Jim    -1.907958 -1.091894
Travis -0.545635  1.127662

In [41]:
map_series = pd.Series(mapping)

In [42]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [43]:
people.groupby(map_series,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [44]:
people.groupby(len).sum()

          a         b         c         d         e
3  1.591378 -0.112069  1.266695 -0.002412 -1.271784
5  0.403950 -0.718331 -0.911294 -0.270169 -0.021204
6  0.666771  1.121080 -0.450967 -0.094667 -0.660190

In [45]:
len

In [46]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [47]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one  0.033459 -0.195207  1.911560  0.071015  0.193377
  two  0.750745  0.083138 -0.644865 -1.263093 -1.925777
5 one  0.403950 -0.718331 -0.911294 -0.270169 -0.021204
6 two  0.666771  1.121080 -0.450967 -0.094667 -0.660190

In [48]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP',
'JP'],[1, 3, 5, 1, 3]],names=['cty', 'tenor'])
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [49]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.833152 -2.422678 -0.094848 -0.186824 -1.199094
1      3.209512 -0.557789 -1.625070 -0.931813 -1.077838
2     -0.794226  0.645635  0.547611 -0.272172 -0.993059
3      0.647948 -1.240265  0.881847 -0.455556  1.712115

In [50]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [51]:
df

      data1     data2 key1 key2
0  0.404707  0.091001    a  one
1 -0.871899  0.848397    a  two
2 -1.155719 -0.770773    b  one
3 -0.428884 -0.748555    b  two
4 -0.919550 -0.305541    a  one

In [52]:
grouped = df.groupby('key1')

In [54]:
grouped['data1'].quantile(0.9
                         )

key1
a    0.149386
b   -0.501568
Name: data1, dtype: float64

In [56]:
def peak_to_peak(arr):
    return arr.max()-arr.min()

In [58]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.324257  1.153938
b     0.726835  0.022218

In [59]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.462247  0.751183 -0.919550 -0.895725 -0.871899 -0.233596
b      2.0 -0.792301  0.513950 -1.155719 -0.974010 -0.792301 -0.610593

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.404707   3.0  0.211286  0.586297 -0.305541 -0.107270  0.091001
b    -0.428884   2.0 -0.759664  0.015710 -0.770773 -0.765218 -0.759664


           75%       max
key1
a     0.469699  0.848397
b    -0.754109 -0.748555

In [60]:
 tips = pd.read_csv('examples/tips.csv')

In [62]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [63]:
tips[:6]

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808
5       25.29  4.71     No  Sun  Dinner     4  0.186240

In [64]:
grouped = tips.groupby(['day','smoker'])

In [65]:
grouped_pct = grouped['tip_pct']

In [66]:
grouped_pct.agg('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [67]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [68]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [69]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389